Строки

String str = "Это строка!";
String str1 = new String("Это строка!");

if(str == str1) { // сравнение ссылок
	// Сюда программа не попадёт
} else {
	// Сюда программа попадёт, т.к. ссылки разные
}

Сравнить содержимое строк
if(str.equals(str1)) { // сравнение содержимых строк
	System.out.println("Строки равны!")
}

boolean equals(String str) // сравнивает содержимое строк

char charAt(int index); // Выводит символ под индексом в строке

substring(int begin); // Срезает и возвращает строку от индекса begin включительно и до конца строки

substring(int begin, int end); // Срезает и возвращает строку от индекса begin включительно до end не включительно

int length(); // Получение длины строки

char[] toCharArray(String str);

Написать программу которая принимает в качестве аргумента номер телефона и выдаёт его частично скрытую форму
Пример
+79993213232
********3232
89993213232
*******3232

Получение длины строки str.length() 


Необходимо написать программу, которая сравнивает строки одинаковой длины и выдаёт какая из строк больше. Не используя библиотечные функции. Возьмите две строки из консоли.

ab < ba
a < b
abc < cba
aab > aaa